testCases/SD_ReB3500_AR1/constant/polyMesh/blockMeshDict.bu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
        (0 -.1  1.0)//0
        (9 -.1  1.0)//1
        (9  .1  1.0)//2
        (0  .1  1.0)//3
        (0 -.1  2.0)//4
        (9 -.1  2.0)//5
        (9  .1  2.0)//6
        (0  .1  2.0)//7
        (0 -.1  3.035)//8
        (9 -.1  3.035)//9
        (9  .1  3.035)//10
        (0  .1  3.035)//11
);

blocks
(
        //hex (0 1 3 2 6 7 9 8) (40 25 30) simpleGrading (1 10.7028 1)
        hex (0 1 2 3 4 5 6 7)   (100 1 30) simpleGrading (1 1 10)
        hex (4 5 6 7 8 9 10 11) (100 1 30) simpleGrading (1 1 0.1)
);

/*
edges
(
      spline 0 1 ((0.25 -0.1 0.1))
      spline 3 2 ((0.75  0.1 0.1))
);
*/

//EDGES-START
/*edges
(
spline 0 1 (
(0.0 -.1 1.0)
(0.00900900900901 -.1 1.0)
(0.018018018018 -.1 1.0)
(0.027027027027 -.1 1.0)
(0.036036036036 -.1 1.0)
(0.045045045045 -.1 1.0)
(0.0540540540541 -.1 1.0)
(0.0630630630631 -.1 1.0)
(0.0720720720721 -.1 1.0)
(0.0810810810811 -.1 1.0)
(0.0900900900901 -.1 1.0)
(0.0990990990991 -.1 1.0)
(0.108108108108 -.1 1.0)
(0.117117117117 -.1 0.999926318545)
(0.126126126126 -.1 0.999675839701)
(0.135135135135 -.1 0.999353851027)
(0.144144144144 -.1 0.998953045159)
(0.153153153153 -.1 0.998466114731)
(0.162162162162 -.1 0.997885752378)
(0.171171171171 -.1 0.997204650737)
(0.18018018018 -.1 0.996415502442)
(0.189189189189 -.1 0.995511000128)
(0.198198198198 -.1 0.99448383643)
(0.207207207207 -.1 0.993326703984)
(0.216216216216 -.1 0.992032295425)
(0.225225225225 -.1 0.990593303388)
(0.234234234234 -.1 0.989002420508)
(0.243243243243 -.1 0.98725233942)
(0.252252252252 -.1 0.98533575276)
(0.261261261261 -.1 0.983245353162)
(0.27027027027 -.1 0.980973833263)
(0.279279279279 -.1 0.978513885696)
(0.288288288288 -.1 0.975858203098)
(0.297297297297 -.1 0.972999478103)
(0.306306306306 -.1 0.969930403346)
(0.315315315315 -.1 0.966643671464)
(0.324324324324 -.1 0.963132051511)
(0.333333333333 -.1 0.959393316811)
(0.342342342342 -.1 0.95543324833)
(0.351351351351 -.1 0.951258346061)
(0.36036036036 -.1 0.946875110001)
(0.369369369369 -.1 0.942290040143)
(0.378378378378 -.1 0.937509636482)
(0.387387387387 -.1 0.932540399013)
(0.396396396396 -.1 0.92738882773)
(0.405405405405 -.1 0.922061422629)
(0.414414414414 -.1 0.916564683703)
(0.423423423423 -.1 0.910905110947)
(0.432432432432 -.1 0.905089204356)
(0.441441441441 -.1 0.899123463925)
(0.45045045045 -.1 0.893014389649)
(0.459459459459 -.1 0.886768481521)
(0.468468468468 -.1 0.880392239536)
(0.477477477477 -.1 0.87389216369)
(0.486486486486 -.1 0.867274753976)
(0.495495495495 -.1 0.86054651039)
(0.504504504505 -.1 0.85371391406)
(0.513513513514 -.1 0.846783012194)
(0.522522522523 -.1 0.839759418081)
(0.531531531532 -.1 0.832648726145)
(0.540540540541 -.1 0.825456530806)
(0.54954954955 -.1 0.818188426489)
(0.558558558559 -.1 0.810850007615)
(0.567567567568 -.1 0.803446868607)
(0.576576576577 -.1 0.795984603888)
(0.585585585586 -.1 0.788468807879)
(0.594594594595 -.1 0.780905075005)
(0.603603603604 -.1 0.773298999686)
(0.612612612613 -.1 0.765656176347)
(0.621621621622 -.1 0.757982199408)
(0.630630630631 -.1 0.750282663294)
(0.63963963964 -.1 0.742563162426)
(0.648648648649 -.1 0.734829291228)
(0.657657657658 -.1 0.72708664412)
(0.666666666667 -.1 0.719340815527)
(0.675675675676 -.1 0.711597399871)
(0.684684684685 -.1 0.703861991574)
(0.693693693694 -.1 0.696140185059)
(0.702702702703 -.1 0.688437574749)
(0.711711711712 -.1 0.680759755065)
(0.720720720721 -.1 0.673111937382)
(0.72972972973 -.1 0.665495570003)
(0.738738738739 -.1 0.657909965352)
(0.747747747748 -.1 0.650354411339)
(0.756756756757 -.1 0.642828195871)
(0.765765765766 -.1 0.635330606858)
(0.774774774775 -.1 0.627860932208)
(0.783783783784 -.1 0.62041845983)
(0.792792792793 -.1 0.613002477633)
(0.801801801802 -.1 0.605612273526)
(0.810810810811 -.1 0.598247135417)
(0.81981981982 -.1 0.590906351215)
(0.828828828829 -.1 0.58358920883)
(0.837837837838 -.1 0.576294996169)
(0.846846846847 -.1 0.569023001141)
(0.855855855856 -.1 0.561772511656)
(0.864864864865 -.1 0.554542815622)
(0.873873873874 -.1 0.547333200948)
(0.882882882883 -.1 0.540142955543)
(0.891891891892 -.1 0.532971367315)
...
)
spline 3 2 (
(0.0 .1 1.0)
(0.00900900900901 .1 1.0)
(0.018018018018 .1 1.0)
(0.027027027027 .1 1.0)
(0.036036036036 .1 1.0)
(0.045045045045 .1 1.0)
(0.0540540540541 .1 1.0)
(0.0630630630631 .1 1.0)
(0.0720720720721 .1 1.0)
(0.0810810810811 .1 1.0)
(0.0900900900901 .1 1.0)
(0.0990990990991 .1 1.0)
(0.108108108108 .1 1.0)
(0.117117117117 .1 0.999926318545)
(0.126126126126 .1 0.999675839701)
(0.135135135135 .1 0.999353851027)
(0.144144144144 .1 0.998953045159)
(0.153153153153 .1 0.998466114731)
(0.162162162162 .1 0.997885752378)
(0.171171171171 .1 0.997204650737)
(0.18018018018 .1 0.996415502442)
(0.189189189189 .1 0.995511000128)
(0.198198198198 .1 0.99448383643)
(0.207207207207 .1 0.993326703984)
(0.216216216216 .1 0.992032295425)
(0.225225225225 .1 0.990593303388)
(0.234234234234 .1 0.989002420508)
(0.243243243243 .1 0.98725233942)
(0.252252252252 .1 0.98533575276)
(0.261261261261 .1 0.983245353162)
(0.27027027027 .1 0.980973833263)
(0.279279279279 .1 0.978513885696)
(0.288288288288 .1 0.975858203098)
(0.297297297297 .1 0.972999478103)
(0.306306306306 .1 0.969930403346)
(0.315315315315 .1 0.966643671464)
(0.324324324324 .1 0.963132051511)
(0.333333333333 .1 0.959393316811)
(0.342342342342 .1 0.95543324833)
(0.351351351351 .1 0.951258346061)
(0.36036036036 .1 0.946875110001)
(0.369369369369 .1 0.942290040143)
(0.378378378378 .1 0.937509636482)
(0.387387387387 .1 0.932540399013)
(0.396396396396 .1 0.92738882773)
(0.405405405405 .1 0.922061422629)
(0.414414414414 .1 0.916564683703)
(0.423423423423 .1 0.910905110947)
(0.432432432432 .1 0.905089204356)
(0.441441441441 .1 0.899123463925)
(0.45045045045 .1 0.893014389649)
(0.459459459459 .1 0.886768481521)
(0.468468468468 .1 0.880392239536)
(0.477477477477 .1 0.87389216369)
(0.486486486486 .1 0.867274753976)
(0.495495495495 .1 0.86054651039)
(0.504504504505 .1 0.85371391406)
(0.513513513514 .1 0.846783012194)
(0.522522522523 .1 0.839759418081)
(0.531531531532 .1 0.832648726145)
(0.540540540541 .1 0.825456530806)
(0.54954954955 .1 0.818188426489)
(0.558558558559 .1 0.810850007615)
(0.567567567568 .1 0.803446868607)
(0.576576576577 .1 0.795984603888)
(0.585585585586 .1 0.788468807879)
(0.594594594595 .1 0.780905075005)
(0.603603603604 .1 0.773298999686)
(0.612612612613 .1 0.765656176347)
(0.621621621622 .1 0.757982199408)
(0.630630630631 .1 0.750282663294)
(0.63963963964 .1 0.742563162426)
(0.648648648649 .1 0.734829291228)
(0.657657657658 .1 0.72708664412)
(0.666666666667 .1 0.719340815527)
(0.675675675676 .1 0.711597399871)
(0.684684684685 .1 0.703861991574)
(0.693693693694 .1 0.696140185059)
(0.702702702703 .1 0.688437574749)
(0.711711711712 .1 0.680759755065)
(0.720720720721 .1 0.673111937382)
(0.72972972973 .1 0.665495570003)
(0.738738738739 .1 0.657909965352)
(0.747747747748 .1 0.650354411339)
(0.756756756757 .1 0.642828195871)
(0.765765765766 .1 0.635330606858)
(0.774774774775 .1 0.627860932208)
(0.783783783784 .1 0.62041845983)
(0.792792792793 .1 0.613002477633)
(0.801801801802 .1 0.605612273526)
(0.810810810811 .1 0.598247135417)
(0.81981981982 .1 0.590906351215)
(0.828828828829 .1 0.58358920883)
(0.837837837838 .1 0.576294996169)
(0.846846846847 .1 0.569023001141)
(0.855855855856 .1 0.561772511656)
(0.864864864865 .1 0.554542815622)
(0.873873873874 .1 0.547333200948)
(0.882882882883 .1 0.540142955543)
(0.891891891892 .1 0.532971367315)
...
);
//EDGES-END
//EDGES-END
*/

boundary
(
    bottomWall
    {
        type            wall;
        faces           ((0 3 2 1));
    }
    topWall
    {
        type            wall;
        faces           ((8 9 10 11));
    }

    inlet_half0
    {
        type            cyclic;
        neighbourPatch  outlet_half0;
        faces           ((0 4 7 3));
    }

    inlet_half1
    {
        type            cyclic;
        neighbourPatch  outlet_half1;
        faces           ((4 8 11 7));
    }

    outlet_half0
    {
        type            cyclic;
        neighbourPatch  inlet_half0;
        faces           ((6 5 1 2));
    }

    outlet_half1
    {
        type            cyclic;
        neighbourPatch  inlet_half1;
        faces           ((10 9 5 6));
    }

    sideRight_half0
    {
        type            cyclic;
        neighbourPatch  sideLeft_half0;
        faces           ((0 1 5 4));
    }

    sideRight_half1
    {
        type            cyclic;
        neighbourPatch  sideLeft_half1;
        faces           ((4 5 9 8));
    }

    sideLeft_half0
    {
        type            cyclic;
        neighbourPatch  sideRight_half0;
        faces           ((3 7 6 2));
    }

    sideLeft_half1
    {
        type            cyclic;
        neighbourPatch  sideRight_half1;
        faces           ((7 11 10 6));
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
