testCases/SD_ReB3500_AR1/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}
gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(phi,U)      Gauss linearUpwind grad(U);
    div(U)			Gauss linear;

    div(phi,k)      bounded Gauss linearUpwind limited; 
    div(phi,omega)	bounded Gauss linearUpwind limited;
    div(phi,epsilon) bounded Gauss linearUpwind limited;

    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(dAij) Gauss linear;
    div(((2*k)*dBij)) Gauss linear;
    div(dev(((2*k)*bijDelta))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
    interpolate(U)  linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p               ;
}

wallDist
{
    method          meshWave;

    // Optionally correct distance from near-wall cells to the boundary
    correctWalls    true;
}

// ************************************************************************* //
